# SuccessToConvertLine Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GeometryFailures..::..SuccessToConvertLine Property
BuiltInFailures..::..GeometryFailures Class See Also
---
Success to convert lines
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SuccessToConvertLine { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SuccessToConvertLine As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SuccessToConvertLine {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GeometryFailures Class
Autodesk.Revit.DB Namespace